// 1)створити у index.html кнопку
// на цю кнопку додати прослуховувач дії "click"
// по кліку на цю кнопку має намалюватись один зі списків минулої ДЗ або можете створити новий список.

// приклад масиву з минулого ДЗ
const ingredients = [
  "Potatoes",
  "Mushrooms",
  "Garlic",
  "Tomatos",
  "Herbs",
  "Condiments",
];

// 2) при натисканні на "Escape" має змінюватись фон сторінки на #420042
// при натисканні комбінації клавіш ctrl + alt + S має змінюватись фон сторінки на #303030
// при відпусканні ваших клавіш сторінка має знову ставати білою #ffffff

// 3) (завдання не обов'язкове до виконання але з цікавинокою)
// Уся середа та саме завдання для виконання знаходиться у папці task можете скопіювати їй собі та працювати тільки з JS
