// Створити класс Сar який буде містити поля brand,model,price. додати до класу
// метод який повертає ціну та метод який може дозволити змінювати ціну.
// додати приватну властивість engine
// додати до неї гетери та сетери (переглянути класс Worker який ми писали на уроці)




// задача яку обіцяв

const arr = [1, 2, 3, 4, 5];

Array.prototype.mnoz = function (n) {
  return this.map(function (number) {
    return number * n;
  });
};

console.log(arr.mnoz(2));

// спробуйте тепер використовувати в інших файлах функцію mnoz якби ви зазвичай використовували якийсь метод масиву
// вказуючи параметром на яке число множити елементи
// const arr = [1, 2, 3, 4, 5].mnoz(2);
